ALanStewart47/Stm32BoardSupportPackage/STM32F10X/Cp/Bsp/Src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: bsp_SetUartParam
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）
*	形    参: Instance   USART_TypeDef类型结构体
*             BaudRate   波特率
*             Parity     校验类型，奇校验或者偶校验
*             Mode       发送和接收模式使能
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_SetUartParam(USART_TypeDef *Instance,  uint32_t BaudRate, uint32_t Parity, uint32_t Mode)
{
	UART_HandleTypeDef UartHandle	= {0};

	
	/*##-1- 配置串口硬件参数 ######################################*/
	/* 异步串口模式 (UART Mode) */
	/* 配置如下:
	  - 字长    = 8 位
	  - 停止位  = 1 个停止位
	  - 校验    = 参数Parity
	  - 波特率  = 参数BaudRate
	  - 硬件流控制关闭 (RTS and CTS signals) */
	
	UartHandle.Instance        = Instance;
	UartHandle.Init.BaudRate   = BaudRate;
	UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
	UartHandle.Init.StopBits   = UART_STOPBITS_1;
	UartHandle.Init.Parity     = Parity;
	UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
	UartHandle.Init.Mode       = Mode;
	UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;

	if (HAL_UART_Init(&UartHandle) != HAL_OK)
	{
		
		Error_Handler(__FILE__, __LINE__);
	}

	
	//HAL_UART_Receive_IT(&UartHandle,g_tUart1.pRxBuf,UART1_RX_BUF_SIZE);
}


//void bsp_SetUartDMAParam(USART_TypeDef *Instance,  uint32_t BaudRate, uint32_t Parity, uint32_t Mode)
//{
//	UART_HandleTypeDef UartHandle	= {0};

//	
//	/*##-1- 配置串口硬件参数 ######################################*/
//	/* 异步串口模式 (UART Mode) */
//	/* 配置如下:
//	  - 字长    = 8 位
//	  - 停止位  = 1 个停止位
//	  - 校验    = 参数Parity
//	  - 波特率  = 参数BaudRate
//	  - 硬件流控制关闭 (RTS and CTS signals) */
//	
//	UartHandle.Instance        = Instance;
//	UartHandle.Init.BaudRate   = BaudRate;
//	UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
//	UartHandle.Init.StopBits   = UART_STOPBITS_1;
//	UartHandle.Init.Parity     = Parity;
//	UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
//	UartHandle.Init.Mode       = Mode;
//	UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;

//	if (HAL_UART_Init(&UartHandle) != HAL_OK)
//	{
//		
//		Error_Handler(__FILE__, __LINE__);
//	}
//	
////	SET_BIT(USART1->SR, USART_SR_TC);					/* 清除TC发送完成标志 */
////	SET_BIT(USART1->SR, USART_SR_RXNE);  			/* 清除RXNE接收标志 */
////	SET_BIT(USART1->CR1, UART_IT_RXNE);				/* 使能RX非空中断 */
//	
//	  __HAL_RCC_DMA1_CLK_ENABLE();
//	
//		DMA_HandleTypeDef	DmaTxHandle ={0};
//   /* USART1_TX Init */

//    DmaTxHandle.Instance = DMA1_Channel4;
//    DmaTxHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
//    DmaTxHandle.Init.PeriphInc = DMA_PINC_DISABLE;
//    DmaTxHandle.Init.MemInc = DMA_MINC_ENABLE;
//    DmaTxHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
//    DmaTxHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
//    DmaTxHandle.Init.Mode = DMA_NORMAL;
//    DmaTxHandle.Init.Priority = DMA_PRIORITY_HIGH;
//    if (HAL_DMA_Init(&DmaTxHandle) != HAL_OK)
//    {
//      Error_Handler();
//    }

//    __HAL_LINKDMA(&UartHandle,hdmatx,DmaTxHandle);
//		
//	HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, 5, 0);
//  HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);
//		
//	SET_BIT(USART1->SR, USART_SR_TC);					/* 清除TC发送完成标志 */
//	SET_BIT(USART1->SR, USART_SR_RXNE);  			/* 清除RXNE接收标志 */
//	SET_BIT(USART1->CR1, UART_IT_RXNE);				/* 使能RX非空中断 */
//}


/*
*********************************************************************************************************
*	函 数 名: InitHardUart
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-H7开发板
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void InitHardUart(void)
{
	GPIO_InitTypeDef  GPIO_InitStruct;

#if UART1_FIFO_EN == 1		/* 串口1 */
	/* 使能 GPIO TX/RX 时钟 */
	USART1_TX_GPIO_CLK_ENABLE();
	USART1_RX_GPIO_CLK_ENABLE();

	/* 使能 USARTx 时钟 */
	USART1_CLK_ENABLE();	

	/* 配置TX引脚 */
	GPIO_InitStruct.Pin       = USART1_TX_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(USART1_TX_GPIO_PORT, &GPIO_InitStruct);	
	
	/* 配置RX引脚 */
	GPIO_InitStruct.Pin = USART1_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  //GPIO_InitStruct.Pull = GPIO_PULLUP;
	HAL_GPIO_Init(USART1_RX_GPIO_PORT, &GPIO_InitStruct);
	
	/* 配置NVIC the NVIC for UART */   
	HAL_NVIC_SetPriority(USART1_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(USART1_IRQn);

	/* 配置波特率、奇偶校验 ，由于添加了波特率可调的功能，故固定值改为变量	*/
	bsp_SetUartParam(USART1,  g_Uart1_Baud, UART_PARITY_NONE, UART_MODE_TX_RX);	// UART_MODE_TX_RX

	SET_BIT(USART1->SR, USART_SR_TC);					/* 清除TC发送完成标志 */
	SET_BIT(USART1->SR, USART_SR_RXNE);  			/* 清除RXNE接收标志 */
	SET_BIT(USART1->CR1, UART_IT_RXNE);				/* 使能RX非空中断 */

#endif

#if UART2_FIFO_EN == 1		/* 串口2 */
	/* 使能 GPIO TX/RX 时钟 */
	USART2_TX_GPIO_CLK_ENABLE();
	USART2_RX_GPIO_CLK_ENABLE();
	
	/* 使能 USARTx 时钟 */
	USART2_CLK_ENABLE();	

	/* 配置TX引脚 */
	GPIO_InitStruct.Pin       = USART2_TX_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	//GPIO_InitStruct.Pull      = GPIO_PULLUP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(USART2_TX_GPIO_PORT, &GPIO_InitStruct);	
	
	/* 配置RX引脚 */
	GPIO_InitStruct.Pin = USART2_RX_PIN;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	HAL_GPIO_Init(USART2_RX_GPIO_PORT, &GPIO_InitStruct);

	/* 配置NVIC the NVIC for UART */   
	HAL_NVIC_SetPriority(USART2_IRQn, 8, 0);
	HAL_NVIC_EnableIRQ(USART2_IRQn);
  
	/* 配置波特率、奇偶校验 */
	bsp_SetUartParam(USART2,  UART2_BAUD, UART_PARITY_NONE, UART_MODE_TX_RX);	// UART_MODE_TX_RX

	SET_BIT(USART2->SR, USART_SR_TC);	/* 清除TC发送完成标志 */
	SET_BIT(USART2->SR, USART_SR_RXNE);/* 清除RXNE接收标志 */
	SET_BIT(USART2->CR1, UART_IT_RXNE);	/* 使能PE. RX接受中断 */
	
#endif

#if UART3_FIFO_EN == 1			/* 串口3 */
	/* 使能 GPIO TX/RX 时钟 */
	USART3_TX_GPIO_CLK_ENABLE();
	USART3_RX_GPIO_CLK_ENABLE();
	
	/* 使能 USARTx 时钟 */
	USART3_CLK_ENABLE();	

	/* 配置TX引脚 */
	GPIO_InitStruct.Pin       = USART3_TX_PIN;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	//GPIO_InitStruct.Pull      = GPIO_PULLUP;
	GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(USART3_TX_GPIO_PORT, &GPIO_InitStruct);	
	
